app/views/gists/_form.html.erb

    <%= f.label :group %><br>
    <%= f.select :group_id, Group.all.collect { |x| [x.name,x.id] } %>
---
SELECT "groups".* FROM "groups"