app/views/gists/_gist.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 69]]
---
  <strong>Group:</strong>
  <% if gist.group %>