app/views/gists/show.html.erb

        <strong>Group:</strong>
        <% if @gist.group %>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 69]]