app/controllers/gists_controller.rb

SELECT "gists".* FROM "gists" WHERE (lang LIKE '%abc%') ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "gists"
---
  def index
    @gists = Gist.paginate(:page => params[:page]).order('created_at DESC').search(params[:search])

INSERT INTO "gists" ("created_at", "description", "lang", "snippet", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 13 May 2014 09:11:53 UTC +00:00], ["description", "zmienna"], ["lang", "C"], ["snippet", "int i;"], ["updated_at", Tue, 13 May 2014 09:11:53 UTC +00:00]]
---
  def create
    @gist = Gist.new(gist_params)
    respond_to do |format|
      if @gist.save

DELETE FROM "gists" WHERE "gists"."id" = ?  [["id", 1]]
---
  def destroy
    @gist.destroy

SELECT "gists".* FROM "gists"
---
  def search
    @gists = Gist.search(params[:lang])

SELECT  "gists".* FROM "gists"  WHERE "gists"."id" = ?  ORDER BY created_at DESC LIMIT 1 OFFSET 0  [["id", "all"]]
---
    def set_gist
      @gist = Gist.find(params[:id])