app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups" ORDER BY created_at LIMIT 10 OFFSET 0
---
  def new
    @groups = Group.order('created_at').paginate(:page => params[:page])

INSERT INTO "groups" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 17 May 2014 21:30:38 UTC +00:00], ["name", "abc"], ["updated_at", Sat, 17 May 2014 21:30:38 UTC +00:00]]
---
  def create
    @group = Group.new(group_parameters)
    if @group.save

SELECT "groups".* FROM "groups" ORDER BY created_at LIMIT 10 OFFSET 0
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @groups = Group.order('created_at').paginate(:page => params[:page])
    @group = Group.find(params[:id])

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "groups" SET "name" = ?, "updated_at" = ? WHERE "groups"."id" = 1  [["name", "def"], ["updated_at", Sat, 17 May 2014 21:35:54 UTC +00:00]]
---
  def update
    debugger
    @group = Group.find(params[:id])
    if @group.update_attributes(group_parameters)